package com.javarush.test.level10.lesson11.home04;

/* Большая зарплата
Вывести на экран надпись «Я не хочу изучать Java, я хочу большую зарплату» 40 раз по образцу.
Образец:
Я не хочу изучать Java, я хочу большую зарплату
 не хочу изучать Java, я хочу большую зарплату
не хочу изучать Java, я хочу большую зарплату
е хочу изучать Java, я хочу большую зарплату
 хочу изучать Java, я хочу большую зарплату
хочу изучать Java, я хочу большую зарплату
…
*/

import java.util.ArrayList;

public class Solution
{
    public static void main(String[] args)
    {
        String s = "Я не хочу изучать Java, я хочу большую зарплату";
        //напишите тут ваш код
        ArrayList<Character> list=new ArrayList<Character>();
        for(int j=0;j<s.length();j++)list.add(s.charAt(j));
        for (int i=0;i<40;i++){
            for(Character c:list)System.out.print(c);
            list.remove(0);
            System.out.println();
        }
    }

}
